Q1. create a pandas series that contains the following data : 4, 8,15,16,23, and 42 . then , print the series

In [6]:
# solutin 
import pandas as pd
data = [4,8,15,16,23,42]
df = pd.Series(data)
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of  list type containing 10 elements in it, and apply pandas. Series function on the variable print it .

In [7]:
import pandas as pd 
# Create a list with 10 elements
var = [1,22,4,"bhanu", "dangi", True,3.4, 3,4,5]
# Create a pandas series from the list
series = pd.Series(var)
#Print the series
print(series)

0        1
1       22
2        4
3    bhanu
4    dangi
5     True
6      3.4
7        3
8        4
9        5
dtype: object

Q3 Create a pandas DataFrame that contains the following data:

In [14]:
import pandas as pd 
#create the given data as a dictionary
data = {
        "name": ["alice" , "bo" , "claire"] , 
        "age" : [25,30,27],
        "Gender":["Female","Male","Female"]
        }
#creating the pandas dataframe from the dictionary 
dataframe = pd.DataFrame(data)
# calling the created dataframe
dataframe

     name  age  Gender
0   alice   25  Female
1      bo   30    Male
2  claire   27  Female

Q4.what is "DataFrame" in pandas and how is it different from pandas.series ? expplain with an example

In pandas, a DataFrame is a two-dimensional data structure that represents a tabular, spreadsheet-like data with rows and columns. It can be thought of as a collection of pandas Series, where each Series represents a column of data.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.). It is like a single column of data and has an associated index, which provides labels for each element in the Series.

In [16]:
#series and dataframe example
import pandas as pd

# Example of creating a Series
series_data = pd.Series([10, 20, 30, 40, 50])
print("Series:")
print(series_data)

Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [17]:
# Example of creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 22, 28, 35],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney']
}

df = pd.DataFrame(data)
print("\nDataFrame:")
print(df)

DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   28     Tokyo
4      Eve   35    Sydney

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions for data manipulation in a DataFrame.

In [18]:
#head() and tail()
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Age': [25, 30, 22, 28, 35],
        'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney']}
df = pd.DataFrame(data)

# View the first few rows
print(df.head(3))

# View the last few rows
print(df.tail(2))

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
    Name  Age    City
3  David   28   Tokyo
4    Eve   35  Sydney

In [19]:
# info
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes
None

In [20]:
#describe()
df.describe()

             Age
count   5.000000
mean   28.000000
std     4.949747
min    22.000000
25%    25.000000
50%    28.000000
75%    30.000000
max    35.000000

In [22]:
#Drop a column
df_dropped = df.drop(columns = "City")
df_dropped

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   28
4      Eve   35

In [23]:
#sort by "Age" in ascending order
df_sorted = df.sort_values(by="Age")
df_sorted

      Name  Age      City
2  Charlie   22     Paris
0    Alice   25  New York
3    David   28     Tokyo
1      Bob   30    London
4      Eve   35    Sydney

In [27]:
#Group by "City" and calculate the average age for each city 
df_grouped = df.groupby("City")["Age"].mean()
df_grouped

City
London      30.0
New York    25.0
Paris       22.0
Sydney      35.0
Tokyo       28.0
Name: Age, dtype: float64

In [28]:
# Example of merging two DataFrames based on a common 'Name' column
data_2 = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
          'Gender': ['Female', 'Male', 'Male', 'Male', 'Female']}
df_2 = pd.DataFrame(data_2)

merged_df = df.merge(df_2, on='Name')
print(merged_df)

      Name  Age      City  Gender
0    Alice   25  New York  Female
1      Bob   30    London    Male
2  Charlie   22     Paris    Male
3    David   28     Tokyo    Male
4      Eve   35    Sydney  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, both Series and DataFrame are mutable in nature, meaning you can modify their contents after creation. However, Panel is not mutable.

Series: A pandas Series is mutable because you can change the values of individual elements using their index.

DataFrame: A pandas DataFrame is mutable, and you can add, delete, or modify rows and columns, as well as change the values of individual elements within the DataFrame.

Panel: Panels were used in older versions of pandas to represent three-dimensional data. However, they are deprecated, and it's recommended to use MultiIndex DataFrames or xarray for handling multi-dimensional data. Panels were not mutable and did not offer the same level of flexibility as Series and DataFrames.

Since Panels are deprecated, and their use is discouraged, the focus should be on understanding the mutability of Series and DataFrame, which are the primary data structures for data manipulation in pandas.


Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
import pandas as pd

# Create individual Series
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David', 'Eve'])
ages = pd.Series([25, 30, 22, 28, 35])
cities = pd.Series(['New York', 'London', 'Paris', 'Tokyo', 'Sydney'])

# Combine the Series into a dictionary
data = {
    'Name': names,
    'Age': ages,
    'City': cities
}

# Create the DataFrame using the dictionary
df = pd.DataFrame(data)

# Print the DataFrame
print(df)